In [2]:
#Creating Dictionary
dictionary={
    'Name': ['Ahsan', 'rehman', 'Ali'],
    'Age': [20,25,30],
    'City': ['Sukkur', 'Karachi', 'Hydrabad']
}

In [3]:
import pandas as pd
data_frame= pd.DataFrame(dictionary)
data_frame

     Name  Age      City
0   Ahsan   20    Sukkur
1  rehman   25   Karachi
2     Ali   30  Hydrabad

In [4]:
#Indexing and Sliecing
filter = data_frame[data_frame['Age']> 20]
print(filter)

     Name  Age      City
1  rehman   25   Karachi
2     Ali   30  Hydrabad

In [5]:
#Filtering based on Age and City
filter = data_frame[(data_frame['Age']> 20) & ( data_frame['City']=='Sukkur')][['Name', 'Age', 'City']]
print(filter)

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [6]:
dictionary={
    'Name': ['Ahsan', 'rehman', None, None],
    'Age': [20,None,30, None],
    'City': ['Sukkur', 'Karachi', 'Hydrabad', "Sukkur"]
}
import pandas as pd
data_frame= pd.DataFrame(dictionary)
data_frame

     Name   Age      City
0   Ahsan  20.0    Sukkur
1  rehman   NaN   Karachi
2    None  30.0  Hydrabad
3    None   NaN    Sukkur

In [7]:
#Filling NA values
data_frame['Name'].fillna('Unkown', inplace=True)
data_frame['Age'].fillna(data_frame['Age'].mean(), inplace=True)
data_frame

/tmp/ipykernel_20261/829481497.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data_frame['Name'].fillna('Unkown', inplace=True)
/tmp/ipykernel_20261/829481497.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data_frame['Age'].fillna(data_frame['Age'].mean(), inplace=True)

     Name   Age      City
0   Ahsan  20.0    Sukkur
1  rehman  25.0   Karachi
2  Unkown  30.0  Hydrabad
3  Unkown  25.0    Sukkur

In [8]:
#Sorting the value using Age Column
sorted_table = data_frame.sort_values(by ='Age', ignore_index=True)
print(sorted_table)

     Name   Age      City
0   Ahsan  20.0    Sukkur
1  rehman  25.0   Karachi
2  Unkown  25.0    Sukkur
3  Unkown  30.0  Hydrabad

In [9]:
#Filtering using City
filter_by_city=data_frame[data_frame['City']=='Sukkur'][['Name','Age']]
print(filter_by_city)

     Name   Age
0   Ahsan  20.0
3  Unkown  25.0

In [10]:
dictionary={
    'Name': ['Ahsan', 'rehman', None, None],
    'Age': [20,None,30, None],
    'City': ['Sukkur', 'Karachi', 'Hydrabad', "Sukkur"]
}
import pandas as pd
data_frame= pd.DataFrame(dictionary)
data_frame

     Name   Age      City
0   Ahsan  20.0    Sukkur
1  rehman   NaN   Karachi
2    None  30.0  Hydrabad
3    None   NaN    Sukkur

In [11]:
#Creating and reading CSV file
data_frame.to_csv('data_frame.csv', index=False)
data_frame_read =pd.read_csv('data_frame.csv')
print(data_frame_read)

     Name   Age      City
0   Ahsan  20.0    Sukkur
1  rehman   NaN   Karachi
2     NaN  30.0  Hydrabad
3     NaN   NaN    Sukkur

In [12]:
dictionary={
    'Name': ['Ahsan', 'rehman', None, None, 'Ali','rehan','hyder'],
    'Age': [20,None,30, None,20,10,50],
    'City': ['Sukkur', 'Karachi', 'Hydrabad', "Sukkur",'Pano Aqil', 'Rorhi','Sukkur']
}
import pandas as pd
data_frame= pd.DataFrame(dictionary)
data_frame

     Name   Age       City
0   Ahsan  20.0     Sukkur
1  rehman   NaN    Karachi
2    None  30.0   Hydrabad
3    None   NaN     Sukkur
4     Ali  20.0  Pano Aqil
5   rehan  10.0      Rorhi
6   hyder  50.0     Sukkur

In [13]:
#Feching the data using rows
print(data_frame.iloc[0])

Name     Ahsan
Age       20.0
City    Sukkur
Name: 0, dtype: object

In [14]:
print(data_frame.iloc[:4,:3])

     Name   Age      City
0   Ahsan  20.0    Sukkur
1  rehman   NaN   Karachi
2    None  30.0  Hydrabad
3    None   NaN    Sukkur

In [15]:
#coloumm vise data

print(data_frame.loc[:2,['Name','City']])

     Name      City
0   Ahsan    Sukkur
1  rehman   Karachi
2    None  Hydrabad

In [16]:
#Merging the DataFrames
import pandas as pd
dic1={
    'ID': [1,2,3,4],
    'Name': ['Ahsan', 'rehman', 'Ali', 'bilal']
}

df1= pd.DataFrame(dic1)
df1
dic2={
    'ID': [1,2,3,5],
    'Score': [40,50,70,80]
}

df2= pd.DataFrame(dic2)
df2

   ID  Score
0   1     40
1   2     50
2   3     70
3   5     80

In [18]:
merge_data_frame=pd.merge(df1,df2, on='ID')
print(merge_data_frame)

   ID    Name  Score
0   1   Ahsan     40
1   2  rehman     50
2   3     Ali     70